Revit 2027 API
DimensionType.AlternateUnitsPrefix Property
 The prefix text for the alternate units value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AlternateUnitsPrefix { get; set; }
Public Property AlternateUnitsPrefix As String
	Get
	Set
public:
property String^ AlternateUnitsPrefix {
	String^ get ();
	void set (String^ value);
}
member AlternateUnitsPrefix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace